#include <stdio.h>
#include <locale.h>

int main()
{
	setlocale(LC_ALL, "RUS");

	// 1.1
	printf("%20s \n ", "Это текст");
	// 1.2
	printf("%s \n ", "Это текст");
	// 1.3
	printf("\t%s \n ", "Это текст");
	// 1.4
	printf("%10.3f\n ", 12.234657);
	// 1.5
	printf("%10.5f\n ", 12.234657);
	// 1.6
	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2);
	// 1.7.1
	printf("%d / %d = %d\n ", 7, 5, 7 % 5);
	// 1.7.2
	printf("%d * %d = %d\n ", 2000, 4, 2000 * 4);
	// 1.8
	printf("%g разделить на %e равно %f\n ", 5., 2., 5. / 2);
	// 1.9
	printf("%d разделить на %d равно %d\n ", 5., 2., 5. / 2); // 0 разделить на 1075052544 равно 0
	printf("%f разделить на %f равно %f\n ", 5., 2., 5. / 2); // 5,000000 разделить на 2,000000 равно 2,500000
	printf("%g разделить на %g равно %g\n ", 5., 2., 5. / 2); // 5 разделить на 2 равно 2,5
	printf("%e разделить на %e равно %e\n\n\n\n\n ", 5., 2., 5. / 2); // 5,000000e+00 разделить на 2,000000e+00 равно 2,500000e+00

	// 2
	int N = 15, K = 32;

	printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
	printf("Идет %d минута суток\n", (N*60) + K);
	printf("До полуночи осталось %d часов и %d минут\n", 23 - N, 60 - K);
	printf("С 8.00 прошло %d секунд\n", (N - 8)*3600 + K*60);
	printf("Текущий час = %f суток  и текущая минута = %f часа\n\n\n\n\n", N / 24., K / 60.);


	// 3
	int n = 2, k = 3, m = 1; // 1 вариант
	printf("\t\t\t\t\t\t\t\t\t\t\t\tn = %d, k = %d, m = %d\nn / 333 = %000.1f", n, k, m, n / 333.);
}